// 입력 예시
// 5
// 1 1
// 2 2
// 3 3
// 4 4
// 5 5

// 출력 예시
// 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0

// const arrs = [];
// const arr = [];
// for (let i = 0; i < 19; i++) {
//   arr.push(0);
//   for (let j = 0; j < 1; j++) {
//     arrs.push(arr);
//   }
// }
// // console.log(arrs);
// arrs[0][0] = 1;
// console.log(arr.join(" "));
// console.log(arrs);

// !feedback
const arrs = []; //

for (let i = 0; i < 20; i++) {
  const arr = [];
  for (let j = 0; j < 20; j++) {
    arr.push(0);
  }
  arrs.push(arr);
}

// arrs[0][0] = 1;

const input = [5, [1, 1], [2, 2], [3, 3], [4, 4], [5, 5]];

const caseNum = input[0];
for (let i = 1; i <= caseNum; i++) {
  const [x, y] = input[i];
  arrs[x - 1][y - 1] = 1;
}
console.log(arrs);

// join
for (const arr of arrs) {
  console.log(arr.join(" "));
}
